tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "warashi/formulae", "https://github.com/Warashi/homebrew-formulae.git"
brew "direnv"
brew "docker-completion"
brew "docker-compose-completion"
brew "exa"
brew "fd"
brew "fish"
brew "gh"
brew "ghq"
brew "gibo"
brew "git"
brew "go"
brew "hub"
brew "hugo"
brew "jq"
brew "mackup"
brew "mas"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "sk"
brew "terminal-notifier"
brew "tmux"
brew "tmux-xpanes"
brew "watch"
brew "zsh"
brew "zstd"
cask "1password"
cask "alfred"
cask "appcleaner"
cask "aquaskk"
cask "bartender"
cask "bose-updater"
cask "caffeine"
cask "dash"
cask "discord"
cask "docker"
cask "dropbox"
cask "font-cascadia"
cask "font-source-han-code-jp"
cask "google-chrome"
cask "gpg-suite-no-mail"
cask "hyperswitch"
cask "iterm2"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "microsoft-edge"
cask "slack"
cask "sublime-merge"
cask "sublime-text"
cask "typora"
cask "visual-studio-code"
cask "zsa-wally"
mas "Calcbot", id: 931657367
mas "DaisyDisk", id: 411643860
mas "Day One", id: 1055511498
mas "Fantastical", id: 975937182
mas "iStat Menus", id: 1319778037
mas "LINE", id: 539883307
mas "Magnet", id: 441258766
mas "MindNode", id: 1289197285
mas "Parcel", id: 639968404
mas "Pastebot", id: 1179623856
mas "Quiver", id: 866773894
mas "Reeder", id: 1529448980
mas "Save to Pocket", id: 1477385213
mas "Things", id: 904280696
mas "Tweetbot", id: 1384080005
mas "Twitter", id: 1482454543
mas "Whalebird", id: 1378283354
