tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "itchyny/tap"
tap "mrtc0/openv"
tap "warashi/formulae", "https://github.com/Warashi/homebrew-formulae.git"
# User-friendly launcher for Bazel
brew "bazelisk"
# Load/unload environment variables based on $PWD
brew "direnv"
# Bash, Zsh and Fish completion for Docker
brew "docker-completion"
# Completion script for docker-compose
brew "docker-compose-completion"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# GitHub command-line tool
brew "gh"
# Remote repository management made easy
brew "ghq"
# Access GitHub's .gitignore boilerplates
brew "gibo"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Configurable static site generator
brew "hugo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Keep your Mac's application settings in sync
brew "mackup"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Fuzzy Finder in rust!
brew "sk"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Ultimate terminal divider powered by tmux
brew "tmux-xpanes"
# Executes a program periodically, showing output fullscreen
brew "watch"
# UNIX shell (command interpreter)
brew "zsh"
# Zstandard is a real-time compression algorithm
brew "zstd"
brew "itchyny/tap/mmv"
# A tool that uses the credentials stored in 1password as an environment variable.
brew "mrtc0/openv/openv"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Application launcher and productivity software
cask "alfred"
# Application uninstaller
cask "appcleaner"
cask "atok"
# Software updates for Bose products
cask "bose-updater"
# Utility that prevents the system from going to sleep
cask "caffeine"
# API documentation browser and code snippet manager
cask "dash"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
cask "font-jetbrains-mono-nerd-font"
# Web browser
cask "google-chrome"
# Tools to protect your files
cask "gpg-suite-no-mail"
# Utility to fix grammar errors and style issues in text
cask "grammarly"
cask "hyperswitch"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Keyboard customizer
cask "karabiner-elements"
# Interface for reading and syncing eBooks
cask "kindle"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Multi-platform web browser
cask "microsoft-edge"
# App to write, plan, collaborate, and get organized
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
cask "realforce"
# Team communication and collaboration software
cask "slack"
# Git client
cask "sublime-merge"
# Text editor for code, markup and prose
cask "sublime-text"
# Time tracker
cask "toggl-track"
# Configurable document editor that supports Markdown
cask "typora"
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "zoom"
# Flash tool for ZSA keyboards
cask "zsa-wally"
mas "Bitwarden", id: 1352778147
mas "Calcbot", id: 931657367
mas "DaisyDisk", id: 411643860
mas "Day One", id: 1055511498
mas "Dictionaries", id: 1380563956
mas "Fantastical", id: 975937182
mas "Ghostery Lite", id: 1436953057
mas "HomeControl", id: 1547121417
mas "iStat Menus", id: 1319778037
mas "LINE", id: 539883307
mas "Magnet", id: 441258766
mas "MindNode", id: 1289197285
mas "OpenIn", id: 1547147101
mas "Parcel", id: 639968404
mas "Pastebot", id: 1179623856
mas "PiPifier", id: 1160374471
mas "Pocket", id: 568494494
mas "Reeder", id: 1529448980
mas "Save to Pocket", id: 1477385213
mas "Tampermonkey", id: 1482490089
mas "Things", id: 904280696
mas "Tweetbot", id: 1384080005
mas "TweetShot", id: 1227057295
mas "Twitter", id: 1482454543
mas "Vimari", id: 1480933944
mas "Whalebird", id: 1378283354
